{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 8,
            "kernel_size": [5, 5],
            "strides": [1, 1],
            "padding": "same",
            "activation": "relu",
            "input_shape": [224, 224, 3]
          }
        },
        {
          "class_name": "AveragePooling2D",
          "config": {
            "pool_size": [4, 4],
            "strides": [4, 4],
            "padding": "valid"
          }
        },
        {
          "class_name": "Flatten",
          "config": {}
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 3,
            "activation": "softmax"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["models/document_classifier_cpu.weights.bin"],
      "weights": [
        {"name": "conv2d_1/kernel", "shape": [5, 5, 3, 8], "dtype": "float32"},
        {"name": "conv2d_1/bias", "shape": [8], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [12544, 32], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [32], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [32, 3], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [3], "dtype": "float32"}
      ]
    }
  ],
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v3.6.0",
  "convertedBy": null
}
